{"config": [{"config": {"trainable": true, "input_dtype": "float32", "name": "cropping2d_2", "cropping": [[50, 20], [0, 0]], "batch_input_shape": [null, 160, 320, 3]}, "class_name": "Cropping2D"}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-4-14f4028d65e3>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape": null, "input_dtype": "float32", "name": "lambda_2", "function_type": "lambda", "output_shape_type": "raw", "batch_input_shape": [null, 90, 320, 3], "arguments": {}}, "class_name": "Lambda"}, {"config": {"border_mode": "valid", "b_constraint": null, "name": "convolution2d_5", "nb_col": 5, "W_constraint": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "trainable": true, "b_regularizer": null, "nb_filter": 6, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "valid", "b_constraint": null, "name": "convolution2d_6", "nb_col": 5, "W_constraint": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "trainable": true, "b_regularizer": null, "nb_filter": 6, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "valid", "b_constraint": null, "name": "convolution2d_7", "nb_col": 5, "W_constraint": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "trainable": true, "b_regularizer": null, "nb_filter": 6, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_3", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"input_dim": 1512, "b_constraint": null, "name": "dense_6", "init": "glorot_uniform", "bias": true, "W_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 256, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": 256, "b_constraint": null, "name": "dense_7", "init": "glorot_uniform", "bias": true, "W_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 64, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": 64, "b_constraint": null, "name": "dense_8", "init": "glorot_uniform", "bias": true, "W_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 1, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}