{"config": [{"config": {"trainable": true, "input_dtype": "float32", "name": "cropping2d_1", "cropping": [[50, 20], [0, 0]], "batch_input_shape": [null, 160, 320, 3]}, "class_name": "Cropping2D"}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-5-08370123248f>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape": null, "input_dtype": "float32", "name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "batch_input_shape": [null, 90, 320, 3], "arguments": {}}, "class_name": "Lambda"}, {"config": {"border_mode": "valid", "b_constraint": null, "name": "convolution2d_1", "nb_col": 5, "W_constraint": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "trainable": true, "b_regularizer": null, "nb_filter": 24, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "subsample": [2, 2], "activity_regularizer": null, "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "b_constraint": null, "name": "convolution2d_2", "nb_col": 5, "W_constraint": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "trainable": true, "b_regularizer": null, "nb_filter": 36, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "subsample": [2, 2], "activity_regularizer": null, "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "b_constraint": null, "name": "convolution2d_3", "nb_col": 3, "W_constraint": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3, "trainable": true, "b_regularizer": null, "nb_filter": 48, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "subsample": [2, 2], "activity_regularizer": null, "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "b_constraint": null, "name": "convolution2d_4", "nb_col": 3, "W_constraint": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3, "trainable": true, "b_regularizer": null, "nb_filter": 64, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "subsample": [2, 2], "activity_regularizer": null, "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": 4608, "b_constraint": null, "name": "dense_1", "init": "glorot_uniform", "bias": true, "W_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "output_dim": 2048, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "elu"}, "class_name": "Activation"}, {"config": {"input_dim": 2048, "b_constraint": null, "name": "dense_2", "init": "glorot_uniform", "bias": true, "W_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "output_dim": 256, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "elu"}, "class_name": "Activation"}, {"config": {"input_dim": 256, "b_constraint": null, "name": "dense_3", "init": "glorot_uniform", "bias": true, "W_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "output_dim": 64, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "elu"}, "class_name": "Activation"}, {"config": {"input_dim": 64, "b_constraint": null, "name": "dense_4", "init": "glorot_uniform", "bias": true, "W_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "output_dim": 16, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "elu"}, "class_name": "Activation"}, {"config": {"input_dim": 16, "b_constraint": null, "name": "dense_5", "init": "glorot_uniform", "bias": true, "W_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 1, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}