{"keras_version": "1.2.1", "config": [{"config": {"name": "cropping2d_2", "cropping": [[50, 20], [0, 0]], "trainable": true, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"name": "lambda_2", "arguments": {}, "trainable": true, "batch_input_shape": [null, 90, 320, 3], "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-4-14f4028d65e3>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape_type": "raw", "output_shape": null}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_5", "b_constraint": null, "init": "glorot_uniform", "nb_col": 5, "W_constraint": null, "W_regularizer": null, "nb_row": 5, "activation": "elu", "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "nb_filter": 6, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_6", "b_constraint": null, "init": "glorot_uniform", "nb_col": 5, "W_constraint": null, "W_regularizer": null, "nb_row": 5, "activation": "relu", "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "nb_filter": 6, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_7", "b_constraint": null, "init": "glorot_uniform", "nb_col": 5, "W_constraint": null, "W_regularizer": null, "nb_row": 5, "activation": "relu", "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "nb_filter": 6, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_3", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_6", "b_constraint": null, "init": "glorot_uniform", "output_dim": 256, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "input_dim": 1512, "trainable": true, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dense_7", "b_constraint": null, "init": "glorot_uniform", "output_dim": 64, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "input_dim": 256, "trainable": true, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dense_8", "b_constraint": null, "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "input_dim": 64, "trainable": true, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}