{"config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "name": "cropping2d_5", "trainable": true, "cropping": [[50, 20], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"input_dtype": "float32", "batch_input_shape": [null, 3, 160, 320], "function_type": "lambda", "name": "lambda_12", "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-27-4cffb12ac090>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "output_shape": null}, "class_name": "Lambda"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "elu", "nb_col": 5, "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "valid", "trainable": true, "name": "convolution2d_15", "nb_row": 5, "bias": true, "b_regularizer": null, "nb_filter": 6}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_10", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "relu", "nb_col": 5, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid", "trainable": true, "name": "convolution2d_16", "nb_row": 5, "bias": true, "b_regularizer": null, "nb_filter": 6}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_11", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "relu", "nb_col": 5, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid", "trainable": true, "name": "convolution2d_17", "nb_row": 5, "bias": true, "b_regularizer": null, "nb_filter": 6}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_12", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_6"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "input_dim": 192, "output_dim": 256, "activation": "linear", "name": "dense_16", "trainable": true, "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "input_dim": 256, "output_dim": 64, "activation": "linear", "name": "dense_17", "trainable": true, "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "input_dim": 64, "output_dim": 1, "activation": "linear", "name": "dense_18", "trainable": true, "bias": true, "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}