{"config": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "cropping": [[50, 20], [0, 0]], "input_dtype": "float32"}}, {"class_name": "Lambda", "config": {"trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-5-08370123248f>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw", "output_shape": null, "name": "lambda_1", "batch_input_shape": [null, 90, 320, 3], "input_dtype": "float32", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "subsample": [2, 2], "name": "convolution2d_1", "dim_ordering": "tf", "activation": "elu", "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "border_mode": "valid", "W_constraint": null, "nb_row": 5, "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 24, "b_constraint": null, "activity_regularizer": null, "nb_col": 5}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"trainable": true, "subsample": [2, 2], "name": "convolution2d_2", "dim_ordering": "tf", "activation": "elu", "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "border_mode": "valid", "W_constraint": null, "nb_row": 5, "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 36, "b_constraint": null, "activity_regularizer": null, "nb_col": 5}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"trainable": true, "subsample": [2, 2], "name": "convolution2d_3", "dim_ordering": "tf", "activation": "elu", "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "border_mode": "valid", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 48, "b_constraint": null, "activity_regularizer": null, "nb_col": 3}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"trainable": true, "subsample": [2, 2], "name": "convolution2d_4", "dim_ordering": "tf", "activation": "elu", "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "border_mode": "valid", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "activity_regularizer": null, "nb_col": 3}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "output_dim": 2048, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "activation": "linear", "W_constraint": null, "input_dim": 4608, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "elu"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "output_dim": 256, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "activation": "linear", "W_constraint": null, "input_dim": 2048, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "elu"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_3", "output_dim": 64, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "activation": "linear", "W_constraint": null, "input_dim": 256, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "elu"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_4", "output_dim": 16, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "activation": "linear", "W_constraint": null, "input_dim": 64, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "elu"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_5", "output_dim": 1, "bias": true, "W_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": 16, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null}}], "keras_version": "1.2.1", "class_name": "Sequential"}