{"keras_version": "1.2.1", "config": [{"class_name": "Cropping2D", "config": {"cropping": [[50, 20], [0, 0]], "name": "cropping2d_8", "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 160, 320, 3]}}, {"class_name": "Lambda", "config": {"input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-3d967aa50452>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "batch_input_shape": [null, 90, 320, 3], "output_shape_type": "raw", "name": "lambda_8", "function_type": "lambda", "arguments": {}, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "activation": "elu", "init": "glorot_uniform", "nb_filter": 6, "trainable": true, "bias": true, "subsample": [2, 2], "name": "convolution2d_22", "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_14", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "nb_filter": 6, "trainable": true, "bias": true, "subsample": [1, 1], "name": "convolution2d_23", "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_15", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "nb_filter": 6, "trainable": true, "bias": true, "subsample": [1, 1], "name": "convolution2d_24", "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_16", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 256, "b_constraint": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 192, "trainable": true, "bias": true, "name": "dense_17", "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 64, "b_constraint": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 256, "trainable": true, "bias": true, "name": "dense_18", "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 1, "b_constraint": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 64, "trainable": true, "bias": true, "name": "dense_19", "W_constraint": null, "b_regularizer": null}}], "class_name": "Sequential"}