{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "name": "cropping2d_1", "cropping": [[50, 20], [0, 0]], "trainable": true}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-5-b1f689cd27e1>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 90, 320, 3], "input_dtype": "float32", "name": "lambda_1", "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "arguments": {}, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "b_constraint": null, "name": "convolution2d_1", "W_constraint": null, "activity_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "elu", "b_regularizer": null, "nb_col": 5, "subsample": [2, 2], "trainable": true, "bias": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "b_constraint": null, "name": "convolution2d_2", "W_constraint": null, "activity_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "elu", "b_regularizer": null, "nb_col": 5, "subsample": [2, 2], "trainable": true, "bias": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "b_constraint": null, "name": "convolution2d_3", "W_constraint": null, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "elu", "b_regularizer": null, "nb_col": 3, "subsample": [2, 2], "trainable": true, "bias": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "b_constraint": null, "name": "convolution2d_4", "W_constraint": null, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "elu", "b_regularizer": null, "nb_col": 3, "subsample": [2, 2], "trainable": true, "bias": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_4", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "name": "dense_1", "W_constraint": null, "activity_regularizer": null, "input_dim": 4608, "trainable": true, "output_dim": 2048, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "name": "dense_2", "W_constraint": null, "activity_regularizer": null, "input_dim": 2048, "trainable": true, "output_dim": 256, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_2", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "name": "dense_3", "W_constraint": null, "activity_regularizer": null, "input_dim": 256, "trainable": true, "output_dim": 64, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_3", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "name": "dense_4", "W_constraint": null, "activity_regularizer": null, "input_dim": 64, "trainable": true, "output_dim": 16, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_4", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_regularizer": null, "name": "dense_5", "W_constraint": null, "activity_regularizer": null, "input_dim": 16, "trainable": true, "output_dim": 4, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "bias": true}}]}